<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2e1c43fad985574431b23ffb1011df36d773a0d1373abdc0b8de7dd3dd141b62","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #886 at https://github.com/cal-itp/data-infra/actions/runs/18918271112","plan_out_hash":"dfc26c8aac1919ca3025cb3256643bc85dab9fb6d1d3bf560ccc7cf87e66cebc","plan_hash":"6bfead1f447c5eaf1b08624b83712cc822fd8d5eca598724e372c93b2f9b0c10","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/_mart_benefits.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "/bAzyg==" -> (known after apply)
!~      detect_md5hash      = "Prx7c4IxgDMgw+Po6fnmEA==" -> "different hash"
!~      generation          = 1754938420303891 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/_mart_benefits.yml"
!~      md5hash             = "Prx7c4IxgDMgw+Po6fnmEA==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/_mart_benefits.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "nH3www==" -> (known after apply)
!~      detect_md5hash      = "OBSSkvprb5n9Ku1SrsDS7A==" -> "different hash"
!~      generation          = 1755876750508611 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "OBSSkvprb5n9Ku1SrsDS7A==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #886](https://github.com/cal-itp/data-infra/actions/runs/18918271112)